""""Я учу питон"
Задание
Выведите фразу "Я учу питон" n раз

Формат входных данных
Дано целое положительное число n.

Формат выходных данных
Вывести текст "Я учу питон" заданное количество раз."""

n = int(input("n: "))

count = 0
while n > count:
    print("Я учу питон")
    count += 1
