# Дано 3 кортежа заполненные произвольными целыми числами.
# Найдите количество элементов, которые встречаются во всех трех кортежах.

tup1 = tuple(int(input()))
tup2 = tuple(int(input()))
tup3 = tuple(int(input()))

print(tup1.count('5'))
