# Дан список имен.
# Выведите все имена в одну строку через запятую

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
for i in names:
    print(i, end=", ")
