""""Подсчет символов"
Задание
Подсчитать количество букв «б» во введенной строке

Формат входных данных
Дана произвольная строка.

Формат выходных данных
Вывести количество найденных букв."""

text = input()

text = text.count('б')
print(text)
