""""Первый и последний символ"
Задание
Выведите первый и последний символ данной строки.

Формат входных данных
Дана произвольная строка.

Формат выходных данных
Вывести первый и последний символ строки."""

string = input("Введите произвольный текст: ")

print(string[0])
print(string[-1])