# 1) Сложить два числа

# 2) Попробовать возвести в степень

# 3) Остаток от деления

# 4) Целочисленное деление

# 1) 
print(2 + 2) # сложение

# 2)
print(2 ** 5) # возведение в степень

# 3)
print(15 % 2) # остаток от деления (отбрасывает остаток от деления)

# 4)
print(15 // 2) # целочисленное деление

# 1. Вычислить с помощью интерпретатора Python значение выражения
print(9 - (5 - 3) * (1 + 2 + 8) - 3)

# 2. Вычислить с помощью интерпретатора Python значение выражения
print((11 * 111) / (2 + 4 * 7))

# 3. Вычислить с помощью интерпретатора Python значение выражения
print(-2*(1/2) + 7*(3/5) + 3*(1/3) * 2*(7/4))

# 4. Вычислить с помощью интерпретатора Python значение выражения
print(100500 / (12 +(198 / (27 - 16))) - 123)