""""Удалить запятые"
Задание
Удалите из строки все запятые.

Формат входных данных
Дана произвольная строка.

Формат выходных данных
Вывести исходную строку без запятых."""

text = "Всегда пишите код так, будто сопровождать его будет склонный к насилию психопат, который знает, где вы живете."

text = text.replace(',', '')
print(text)
